Перем ФайлЗагружаетсяИзЦентральнойБазы Экспорт;

Процедура ПриЗаписи(Отказ, Замещение)
	// Вставить содержимое обработчика.        
	ТекОбъект = ЭтотОбъект.Отбор.Объект.Значение;  
	ТекИдентификатор = ЭтотОбъект.Отбор.Идентификатор.Значение;  
	
	
	Если НЕ ФайлЗагружаетсяИзЦентральнойБазы  И СтрНайти(Строка(ТекОбъект.Ссылка), "<Объект не найден> ") = 0 Тогда
	
		НаборЗаписей = РегистрыСведений.ФайлыДляОбмена.СоздатьНаборЗаписей(); 
		НаборЗаписей.Записывать = Истина;
		НаборЗаписей.Отбор.Объект.Установить(ТекОбъект, Истина);
		НаборЗаписей.Отбор.Идентификатор.Установить(ТекИдентификатор, Истина);       
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Объект =  ТекОбъект;      
		НоваяЗапись.Идентификатор =  ТекИдентификатор;   
		НоваяЗапись.НомерПринятого = Константы.УзелДляОбменаСЦентральнойБазой.Получить().НомерПринятого;    
		НоваяЗапись.ДатаВыгрузки = ТекущаяДата();
		
		НаборЗаписей.Записать();                                          
	КонецЕсли;
	
	                                   	
	// Записываем в регистр обмена 
КонецПроцедуры       

ФайлЗагружаетсяИзЦентральнойБазы = Ложь;
