#Область ОписаниеПеременных
Перем ФайлЗагружаетсяИзЦентральнойБазы Экспорт;
#КонецОбласти


#Область ОбработчикиСобытий
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
        Тогда Возврат;
    КонецЕсли;
	        
	ТекОбъект = Отбор.Объект.Значение;   
	ТекИдентификатор = Отбор.Идентификатор.Значение;  
	
	
	Если НЕ ФайлЗагружаетсяИзЦентральнойБазы  И СтрНайти(Строка(ТекОбъект.Ссылка), "<Объект не найден> ") = 0 
		И ТекИдентификатор <> "" Тогда
	
		НаборЗаписей = РегистрыСведений.ФайлыДляОбмена.СоздатьНаборЗаписей(); 
		НаборЗаписей.Записывать = Истина;
		НаборЗаписей.Отбор.Объект.Установить(ТекОбъект, Истина);
		НаборЗаписей.Отбор.Идентификатор.Установить(ТекИдентификатор, Истина);       
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Объект =  ТекОбъект;      
		НоваяЗапись.Идентификатор =  ТекИдентификатор;   
		НоваяЗапись.НомерПринятого = Константы.УзелДляОбменаСЦентральнойБазой.Получить().НомерПринятого;    
		НоваяЗапись.ДатаВыгрузки = ТекущаяДатаСеанса();
		
		
		НаборЗаписей.Записать();                                          
	КонецЕсли;
	
	                                   	
	// Записываем в регистр обмена 
КонецПроцедуры       
#КонецОбласти

#Область Инициализация
ФайлЗагружаетсяИзЦентральнойБазы = Ложь;
#КонецОбласти
