
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)  
	
	Попытка
		ПараметрыВыполненияКоманды.Источник.ТаблицаЗаказНарядов.Обновить(); 
	Исключение
	КонецПопытки;
	
	//Получаем данные с базы 1С
	//Если ВыполнитьСинхронизациюНаСервере() Тогда   
	Если ОбщегоНазначенияСервер.ВыполнитьСинхронизациюНаСервере() Тогда 
		
		Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ФормаКлиентскогоПриложения")
			И ПараметрыВыполненияКоманды.Источник.ИмяФормы = "ОбщаяФорма.ФормаРабочегоСтола" Тогда   
			
			ПараметрыВыполненияКоманды.Источник.Элементы.ТаблицаЗаказНарядов.Обновить();
			
		КонецЕсли;
			
		Сообщить("Синхронизация прошла успешно!");		
	Иначе                                         
		Сообщить("При Синхронизации были ошибки!");		
	КонецЕсли;    
	
//	ПараметрыВыполненияКоманды.Источник.ТаблицаЗаказНарядов.Обновить();

	Попытка
		ПараметрыВыполненияКоманды.Источник.ТаблицаЗаказНарядов.Обновить(); 
	Исключение
	КонецПопытки;
	//ПараметрыВыполненияКоманды.Источник.Прочитать();
	
КонецПроцедуры    
