
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)  
	
	// Первоначальная настройка приложения
	УстановитьЗначениеКонстанты("ПодключениеСервер");
	УстановитьЗначениеКонстанты("ПодключениеПорт");
	УстановитьЗначениеКонстанты("ПодключениеЛогин");
	УстановитьЗначениеКонстанты("ПодключениеПароль");
	УстановитьЗначениеКонстанты("ИмяПубликации");      
	
	// проверяем наличие узлом обмена
	
	ВыборкаУзлов = ПланыОбмена.МобильныйОбмен.Выбрать();
	
	Пока ВыборкаУзлов.Следующий() Цикл  
		Если ВыборкаУзлов.Код = "" Тогда   
			УзелОБъект = ВыборкаУзлов.Ссылка.ПолучитьОбъект();   
			
			Если ВыборкаУзлов.ЭтотУзел Тогда  			
				УзелОБъект.Код = "МБ";
				УзелОБъект.наименование = "Мобильное приложение";		
			КонецЕсли;   
			
			УзелОБъект.Записать();			
		КонецЕсли;		
	КонецЦикла;   
	
		
	// Создаем узел бцентральной базы 
	УзелЦБОбъект = ПланыОбмена.МобильныйОбмен.НайтиПоКоду("ЦБ");
	
	Если НЕ ЗначениеЗаполнено(УзелЦБОбъект) Тогда
		УзелЦБОбъект = ПланыОбмена.МобильныйОбмен.СоздатьУзел();
		УзелЦБОбъект.Код = "ЦБ";
		УзелЦБОбъект.Наименование = "Центральная база";   
		УзелЦБОбъект.Записать();
		
		// устанавливаем значение константы
		Константы.УзелДляОбменаСЦентральнойБазой.Установить(УзелЦБОбъект.Ссылка);
	КонецЕсли;

               
	
	//Пользователь = ОбщегоНазначенияКлиентСервер.обОпределитьТекущегоПользователя();    
	
	Если Константы.РазрешениеФотоВысота.Получить() = 0 
		ИЛИ Константы.РазрешениеФотоШирина.Получить() = 0 Тогда      
		
		// Выставляем по умолчанию разрешение 800 на 600
		Константы.РазрешениеФотоВысота.Установить(600);
		Константы.РазрешениеФотоШирина.Установить(800);	
		
	КонецЕсли;    
	
	// Устанавливаем качество видео елси необходимо
	Если НЕ ЗначениеЗаполнено(Константы.КачествоВидезаписи.Получить()) Тогда
		Константы.КачествоВидезаписи.Установить(Перечисления.КачествоВидеозаписи.Высокое);
	КонецЕсли;     
	
	
	
	

	
	
КонецПроцедуры   

Процедура УстановитьЗначениеКонстанты(ИмяКонстанты)  
	
	ЗначениеКонстанты = Константы[ИмяКонстанты].Получить();
	
	Если НЕ  ЗначениеЗаполнено(ЗначениеКонстанты) Тогда  
		
		Если ИмяКонстанты = "ПодключениеСервер" Тогда
			Константы[ИмяКонстанты].Установить("192.168.11.91");    
			
		ИначеЕсли ИмяКонстанты = "ПодключениеПорт" Тогда
			Константы[ИмяКонстанты].Установить("80");    
			
		ИначеЕсли ИмяКонстанты = "ПодключениеЛогин" Тогда
			Константы[ИмяКонстанты].Установить("tsduser");
			
		ИначеЕсли ИмяКонстанты = "ПодключениеПароль" Тогда
			Константы[ИмяКонстанты].Установить("tsd123");
			
		ИначеЕсли ИмяКонстанты = "ИмяПубликации" Тогда
			Константы[ИмяКонстанты].Установить("TGA");		
			
		КонецЕсли;
	КонецЕсли;     	
	
КонецПроцедуры
