&НаСервере
Функция ПарольСоответствует()
	
	Возврат СокрЛП(Пользователь.ПарольМБ) = СокрЛП(Пароль);	
	
КонецФункции


&НаСервере
Процедура УстановитьПользователя(ВыбПользователь = Неопределено)       
	                                                            	
	Если ВыбПользователь = Неопределено Тогда                   	
		ВыбПользователь = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;                                                  

	ПараметрыСеанса.Пользователь = ВыбПользователь;  
	
	Если ЗначениеЗаполнено(ВыбПользователь) Тогда
		Константы.Пользователь.Установить(ВыбПользователь);
	КонецЕсли;
	
КонецПроцедуры          

&НаСервере
Процедура СоздатьАдмина()    
	
	// Создаем пользователя "admin" если его еще нет
	
	ВыбСсылка = Справочники.Пользователи.НайтиПоКоду("admin");
	Если Не ЗначениеЗаполнено(ВыбСсылка) Тогда
		СпрОбъект = Справочники.Пользователи.СоздатьЭлемент();
		СпрОбъект.Код = "admin";
		СпрОбъект.Наименование = "admin";
		СпрОбъект.ПарольМБ = "123321";
		
		СпрОбъект.Записать();
	КонецЕсли;         
	
КонецПроцедуры

		   
&НаКлиенте
Процедура Авторизация(Команда)
	Если НЕ ПарольСоответствует() Тогда    
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неверно введен пароль";  		
		Сообщение.Поле = "Пароль";
		Сообщение.Сообщить(); 
		
	Иначе    
		УстановитьПользователя(Пользователь);       		
		Закрыть();

	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)    
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьПользователяБазы()
	Возврат ОбщегоНазначенияКлиентСервер.ПользовательПоУмолчанию(); 
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	СоздатьАдмина();    	
	ВыбПользователь =  ПолучитьПользователяБазы();   	
	УстановитьПользователя(ВыбПользователь);          
	 
	Если ЗначениеЗаполнено(ВыбПользователь) 
		И Строка(ВыбПользователь) <> "admin" Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;             	 
КонецПроцедуры
