
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Удаляем комментарйи, будем проверять его по условиям
	ВыбРеквизит = ПроверяемыеРеквизиты.Найти("ПроведениеОсмотра.Комментарий");
	Если ВыбРеквизит <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ВыбРеквизит);
	КонецЕсли;     
	
	
	МассивВидовремонтаНеобхзательныхДляЗаполнения = ОбщегоНазначенияКлиентСервер.МассивНеобязательныхВидовОсмотраДлязаполнения();
	
	// Обходим строки и проверяем заполнение реквизита
    Для Индекс = 1 по ПроведениеОсмотра.Количество() Цикл
		ТекСтрока = ПроведениеОсмотра.Получить(Индекс - 1);
		
		
		Если МассивВидовремонтаНеобхзательныхДляЗаполнения.Найти(ТекСтрока.ВидПроводимогоОсмотра) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.Состояние = Перечисления.ВидыСостоянийОсмотра.НеУказан Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не заполнена колонка ""Состояние"" в строке " + Строка(Индекс) + " списка ""Проведение осмотра""";
			
			Сообщение.Поле = "ПроведениеОсмотра[" + Строка(Индекс-1) + "].Состояние";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;

			
		ИначеЕсли ТекСтрока.Состояние = Перечисления.ВидыСостоянийОсмотра.Удов
			ИЛИ ТекСтрока.Состояние = Перечисления.ВидыСостоянийОсмотра.Крит Тогда
			
			Если СокрЛП(ТекСтрока.Комментарий) = "" И СокрЛП(ТекСтрока.ИдентификаторыПрисоединенныхФайлов) = "" Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Не заполнена колонка ""Комментарий"" или не добавлен файл в строке " + Строка(Индекс) + " списка ""Проведение осмотра""";
				
				Сообщение.Поле = "ПроведениеОсмотра[" + Строка(Индекс-1) + "].Комментарий";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	СостояниеОсмотра = Перечисления.СостоянияОсмотра.НачатьОсмотр;   
	ЗагруженВЦБ = Ложь;
	Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

