
&НаКлиенте
Процедура ТаблицаЗаказНарядовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.       
//	ФормаДока = Элемент.ТекущиеДанные.ЗаказНаряд  

// Закоментил чтобы был обмен только по кнопке "Начать просмотр" на главном экране
	ТаблицаЗаказНарядовВыборНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ТаблицаЗаказНарядовВыборНаСервере()
	ОбщегоНазначенияСервер.ВыполнитьСинхронизациюНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияДанных(Команда)  
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	//Если СинхронизацияДанныхнаСервере() Тогда
	Если ОбщегоНазначенияСервер.ВыполнитьСинхронизациюНаСервере() Тогда
		Сообщить("Синхронизация прошла успешно!");		
	Иначе                                         
		Сообщить("При Синхронизации были ошибки!");		
	КонецЕсли;   
	
	Элементы.ТаблицаЗаказНарядов.Обновить();
	//ЭтаФорма.ОбновитьОтображениеДанных();
	
	//ЭтаФорма.ОбновитьОтображениеДанных(Элементы.ТаблицаЗаказНарядов);     
	

КонецПроцедуры  

//&НаСервере
//Функция СинхронизацияДанныхнаСервере()  
//	Возврат ОбщегоНазначенияСервер.ВыполнитьСинхронизациюНаСервере();	  
//	
//КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭлементОтбораПоСостоянию = Неопределено;                            
	
	Для каждого ТекЭлемент ИЗ  ТаблицаЗаказНарядов.Отбор.Элементы Цикл  		
		Если ТекЭлемент.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Состояние") Тогда    
			ЭлементОтбораПоСостоянию = ТекЭлемент;    
		КонецЕсли;   		         		
	КонецЦикла;    
		
	Если ЭлементОтбораПоСостоянию = Неопределено Тогда 
		ЭлементОтбораПоСостоянию  = ТаблицаЗаказНарядов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;    
	
	// Устаналвиваем отбор по объекту
	ЭлементОтбораПоСостоянию.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Состояние");
    ЭлементОтбораПоСостоянию.ВидСравнения     = ВидСравненияКомпоновкиДанных.НеРавно;
    ЭлементОтбораПоСостоянию.Использование    = Истина;
    ЭлементОтбораПоСостоянию.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    ЭлементОтбораПоСостоянию.ПравоеЗначение   = ВидСостояниеЗакрыт();

	
КонецПроцедуры    

&НаСервере
Функция ВидСостояниеЗакрыт() 
	Возврат Справочники.ВидыСостоянийЗаказНарядов.Закрыт;
	
КонецФункции


&НаКлиенте
Процедура ТаблицаЗаказНарядовПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
                                                                        